using System.Collections;
using System.Collections.Generic;
using UnityEngine;

public class BuildingIntroSave 
{
    private static  BuildingIntroSave m_Instance;
    public static BuildingIntroSave Instance
    {
        get {
            if (m_Instance == null)
                m_Instance = new BuildingIntroSave();
            return m_Instance;
        }
        
    }
    public struct Building
    {
        public string title;
        public string main;
        public string detail;
    }
    public Dictionary<Enum_Building, Building> building;
    public BuildingIntroSave()
    {
        building = new Dictionary<Enum_Building, Building>();
        building.Add(Enum_Building.TianAnMen, new Building()
        {
            title = "天安门"
,
            main = "\n天安门，坐落在中华人民共和国首都北京市的中心、故宫的南端，与天安门广场以及人民英雄纪念碑、毛主席纪念堂、人民大会堂、中国国家博物馆隔长安街相望，占地面积4800平方米，以杰出的建筑艺术和特殊的政治地位为世人所瞩目。"
,
            detail = "\n天安门是明清两代北京皇城的正门，始建于明朝永乐十五年（1417年），最初名“承天门”，寓“承天启运、受命于天”之意。设计者为明代御用建筑匠师蒯祥。清朝顺治八年（1651年）更名为天安门。由城台和城楼两部分组成，有汉白玉石的须弥座，总高34.7米。天安门城楼长66米、宽37米。城台下有券门五阙，中间的券门最大，位于北京皇城中轴线上，过去只有皇帝才可以由此出入。正中门洞上方悬挂着毛泽东画像，两边分别是“中华人民共和国万岁”和“世界人民大团结万岁”的大幅标语。\n民国十四年（1925年）十月十日，故宫博物院成立，天安门开始对民众开放。1949年10月1日，在这里举行了中华人民共和国开国大典，由此被设计入国徽，并成为中华人民共和国的象征。1961年，中华人民共和国国务院公布为第一批全国重点文物保护单位之一。\n天安门在明、清两朝是皇帝颁发诏令之地。称为“金凤颁诏”，遇有新皇帝登基、大婚等重大庆典活动和皇帝父母进宫，都要启用天安门。只有每年祭天、祭地、祭五谷时，才由此门出入。此外，皇帝大婚、将领出征时祭旗、御驾亲征时祭路、刑部秋审等重大仪式也都在此举行。同时，还是“金殿传胪”的场所。\n1949年以后，天安门已经成为现代中国的象征，并被设计入国徽。天安门以其500多年厚重的历史内涵，高度浓缩的中华古代文明和现代文明，同时它还是新中国的象征和无与伦比的政治瞩目和神往，成为了世界和中国各族人民向往的地方。\n\n"
        });

        building.Add(Enum_Building.DiAnMen, new Building()
        {
            title = "地安门",
            main = "地安门，俗称后门，是北京中轴线上的标志性建筑之一，明清皇城北门，位于皇城北垣正中，景山以北，鼓楼以南。1954年拆除。据文献记载，地安门在历史上曾经发挥过重要作用。因为是皇城的北门，凡为皇帝北上出征巡视时大多要出地安门，亲祭地坛诸神时也出地安门。",
            detail = "\n地安门是北京中轴线上的重要标志性建筑之一，是皇城的北门，天安门则是皇城的南门。南北互相对应，寓意天地平安，风调雨顺。地安门是北京皇城四门之一。皇城正门称天安门（明称承天门），东称东安门，西称西安门，北称地安门。明称北安门，俗称厚载门，亦称后门.两层高的雁翅楼曾是中轴线上的重要建筑，1420年与地安门同时修建，位于地安门门楼左右两侧，面宽各13间，黄琉璃瓦覆顶，建筑造型别致，远观好似大雁张开的一对翅膀。\n可惜的是，1954年为疏导地安门周边的交通，地安门及雁翅楼被拆除。2012年，本市启动最大规模的“名城标志性历史建筑恢复工程”，地安门雁翅楼实施复建，复建工程于2013年5月份开工。不过因现有条件所限，位于东侧的雁翅楼被安乐堂胡同和部分民居所挡，只复建了4间；西侧的雁翅楼也受到路边商铺的影响，只恢复了10间。因此，此次复建并没能再现当年雁翅楼的完整容貌。为与原有的雁翅楼区别，原歇山屋面改为悬山屋面，并做断头处理。除地安门雁翅楼外，宝应寺、历代帝王庙西配殿及北围墙、牛街礼拜寺大殿、先农坛外坛坛墙等均已修缮完成，明年五一前将陆续开放。位于前门西河沿街南侧的大栅栏劝业场修缮后将作为体验型博物馆性质的艺术活动中心，预计2016年前投入使用。\n\n "
        });
        building.Add(Enum_Building.GuLou, new Building()
        {
            title = "鼓楼"
            ,main = "北京鼓楼是坐落在北京市南北中轴线北端的一组古代建筑，位于北京东城区地安门外大街北端；是全国重点文物保护单位。两楼前后纵置，气势雄伟、巍峨壮观，高度的技术水平和不朽的艺术价值，充分显示出了古代劳动人民的智慧和力量 。"
            ,detail = "\n北京鼓楼坐北朝南，为重檐三滴水木结构楼阁建筑，通高46.7米。楼身坐落在4米高的砖砌城台之上，东西长约56米，南北宽约33米，台上四周围以宇墙。钟鼓楼作为元、明、清代都城的报时中心，是古都北京的标志性建筑之一，也是见证中国历史的重要建筑。鼓楼位于北京城中轴线的地安门外大街北端，为古代城市的报时台。清代划每夜为五节，每节为两小时，晚7时至9时（戌时）曰定更（又称起更或初更）；9时至11时（亥时）曰二更；11时至此次01时（子时）曰三更；1时至3时（丑时）曰四更；3时至5时（寅）曰五更；五时（申末卯初）曰亮更，即天明之意。定更及亮更，皆先击鼓，后撞钟。而二更至五更则只撞钟不击鼓。\n击钟鼓时先快击十八响，再慢击十八响，俗曰：“紧十八，慢十八”，快慢相间计六次，共108响。元代鼓楼在大都中心，原名齐政楼，取齐七政（日、月、金星、木星、水星、火星、土星）之义，其位置在明清鼓楼以西，今旧鼓楼大街南口。明永乐十八年营建北京，重建钟鼓楼。\n1957年钟鼓楼被列为北京市级文物保护单位。1984年政府拨款重修钟鼓楼，1987年和1988年鼓楼和钟楼相继开放，随后作为展览功能的文物建筑得到了保护和利用。1996年，钟鼓楼 被列为全国重点文物保护单位。\n\n"
        });
        building.Add(Enum_Building.GuGong, new Building()
        {
            title = "故宫"
            ,main = "\n北京故宫是中国明清两代的皇家宫殿，旧称紫禁城，位于北京中轴线的中心。北京故宫以三大殿为中心，占地面积约72万平方米，建筑面积约15万平方米，有大小宫殿七十多座，房屋九千余间。"
            ,
            detail = "\n北京故宫于明成祖永乐四年（1406年）开始建设，以南京故宫为蓝本营建，到永乐十八年（1420年）建成，成为明清两朝二十四位皇帝的皇宫。民国十四年国庆节（1925年10月10日）故宫博物院正式成立开幕。北京故宫南北长961米，东西宽753米，四面围有高10米的城墙，城外有宽52米的护城河。紫禁城有四座城门，南面为午门，北面为神武门，东面为东华门，西面为西华门。城墙的四角，各有一座风姿绰约的角楼，民间有九梁十八柱七十二条脊之说，形容其结构的复杂。\n北京故宫是世界上现存规模最大、保存最为完整的木质结构古建筑之一，是国家AAAAA级旅游景区， [2-3]  1961年被列为第一批全国重点文物保护单位； [4]  1987年被列为世界文化遗产\n\n故宫又称紫禁城。 [8]  中国古代讲究“天人合一”的规划理念，用天上的星辰与都城规划相对应，以突出政权的合法性和皇权的至高性。天帝居住在紫微宫，而人间皇帝自诩为受命于天的“天子”，其居所应象征紫微宫以与天帝对应，《后汉书》载“天有紫微宫，是上帝之所居也。王者立宫，象而为之”。 [9]  紫微、紫垣、紫宫等便成了帝王宫殿的代称。由于封建皇宫在古代属于禁地，常人不能进入，故称为“紫禁”。明朝初期同外禁垣一起统称“皇城”，大约明朝中晚期，与外禁垣区分开来，即宫城叫“紫禁城”，外禁垣为“皇城”。 \n1987年，北京故宫被列入世界文化遗产。世界遗产组织对故宫的评价是：“紫禁城是中国五个多世纪以来的最高权力中心，它以园林景观和容纳了家具及工艺品的9000个房间的庞大建筑群，成为明清时代中国文明无价的历史见证。”\n故宫成为世界文化遗产，使人们对故宫古建筑价值的认识有了深化。故宫所代表的是已经成为历史的文化，而且有着宫廷文化的外壳，同时它却代表了当时的主流文化，经过了长时期的历史筛选和积累，当然不能简单用“封建落后”来概括。故宫和博物院不是毫不相干或对立的，而是有机的统一，相得益彰。把它们结合起来，就可看到，故宫博物院是世界上极少数同时具备艺术博物馆、建筑博物馆、历史博物馆、宫廷文化博物馆等特色，并且符合国际公认的“原址保护”、“原状陈列”基本原则的博物馆和文化遗产。世界文化遗产的基本精神是文化的多样性，从世界文化遗产的角度，人们努力挖掘和认识故宫具有的突出的和普世的价值。\n\n"
        });
        building.Add(Enum_Building.JianLou, new Building()
        {
            title = "箭楼"
      ,
            main = "\n北京城墙箭楼现保存有正阳门箭楼，位于崇文区西北部，前门大街北端，系北京城中轴线天安门南端的重要建筑之一。于1988年1月31日被国务院列为全国重点文物保护单位。"
      ,
            detail = "\n正阳门箭楼始建于明正统四年（1439年），建筑形式为砖砌堡垒式，城台高12米，门洞为五伏五券拱券式，开在城台正中，是内城九门中唯一箭楼开门洞的城门，专走龙车凤辇。箭楼为重檐歇山顶、灰筒瓦绿琉璃剪边。上下共四层，东、南、西三面开箭窗94个，供对外射箭用。箭楼四阔七间，宽62米，北出抱厦五间，宽42米，楼高24米，门两重，前为吊落式闸门（即千斤闸），后为对开铁叶大门。\n正阳门箭楼从它建成那天起，一直是老北京的象征。1915年改建后，更成了北京人游览的场所。1928年辟为国货陈列所，30年代增设电影院，1949年艺人魏喜奎等组织大众游艺社在箭楼演出。1949年2月3日，中国人民解放军曾在此举行盛大的入城式。\n正阳门箭楼曾多次修葺，1976年唐山地震，箭楼严重受损，北京市文物主管部门对箭楼进行全面大修。1989年北京市正阳门管理处集资160万元，将正阳门箭楼修饰一新，1990年1月21日正式对游人开放。\n\n"
        });
        building.Add(Enum_Building.TianAnMenSquare, new Building()
        {
            title = "天安门广场"
    ,
            main = "天安门广场位于北京市中心，南北长880米，东西宽500米，面积达44万平方米，可容纳100万人举行盛大集会。广场内沿北京中轴线由北向南依次矗立着国旗杆、人民英雄纪念碑、毛主席纪念堂和正阳门城楼"
    ,
            detail = "\n明清时期，天安门广场是北京紫禁城正门外的一个宫廷广场，东、西、南三面用围墙围成一片普通百姓不可进入的禁地。广场北起天安门，南至正阳门，东起历史博物馆，西至人民大会堂，南北长880米，东西宽500米，面积达44万平方米。广场中央矗立着人民英雄纪念碑和庄严肃穆的毛主席纪念堂，广场西侧是人民大会堂，东侧面是中国国家博物馆，南侧是两座建于14世纪的古代城楼--正阳门和前门箭楼。天安门城楼坐落在广场的北端。天安门城门五阙，重楼九楹，通高33.7米。天安门两边是劳动人民文化宫和中山公园，这些雄伟的建筑与天安门浑然一体构成了天安门广场，成为北京的一大胜景。\n1949年10月1日，中华人民共和国成立，广场举行开国大典。\n1958年，为迎接十周年国庆，天安门广场开始了史上最大规模的一次扩建。拆除了中华门、棋盘街及广场上的红墙，总面积达44公顷。建筑师陶宗震曾建议把宽度压缩以适应周边道路的连贯，被告知：“不能动，这是毛主席定的。”同时，广场上竖起的人民英雄纪念碑和两侧建起的人民大会堂、中国革命和军事博物馆，奠定了广场作为政治中心的基调。\n广场地面全部由经过特殊工艺技术处理的浅色花岗岩条石铺成，中央矗立着人民英雄纪念碑和庄严肃穆的毛主席纪念堂，天安门两边是劳动人民文化宫和中山公园，与天安门浑然一体，共同构成天安门广场。1986年，天安门广场被评为“北京十六景”之一，景观名“天安丽日”。\n天安门广场记载了中国人民不屈不挠的革命精神和大无畏的英雄气概，五四运动、一二·九运动、五·二〇运动都在这里为中国现代革命史留下了浓重的色彩， [1]  同时还是无数重大政治、历史事件的发生地，是中国从衰落到崛起的历史见证。\n\n"
        });
        building.Add(Enum_Building.Tiantan, new Building()
        {
            title = "天坛"
    ,
            main = "\n天坛公园在北京市南部，东城区永定门内大街东侧。占地约273万平方米。天坛始建于明永乐十八年（1420年），清乾隆、光绪时曾重修改建。现为世界文化遗产，全国重点文物保护单位，国家AAAAA级旅游景区，全国文明风景旅游区示范点。"
    ,
            detail = "\n天坛公园在明、清两代是帝王祭祀皇天、祈五谷丰登之场所。天坛是圜丘、祈谷两坛的总称，有坛墙两重，形成内外坛，坛墙南方北圆，象征天圆地方。主要建筑在内坛，圜丘坛在南、祈谷坛在北，二坛同在一条南北轴线上，中间有墙相隔。圜丘坛内主要建筑有圜丘坛、皇穹宇等等，祈谷坛内主要建筑有祈年殿、皇乾殿、祈年门等。\n据史料记载，有正式祭祀天地的活动，可追溯到公元前两千年，尚处于奴隶制社会的夏朝。中国古代帝王自称“天子”，他们对天地非常崇敬。\n天坛是明永乐十八年（1420年）仿南京形制建天地坛，合祭皇天后土，当时是在大祀殿行祭典。嘉靖九年（1530年）嘉靖皇帝听大臣言：“古者祀天于圜丘，祀地于方丘。圜丘者，南郊地上之丘，丘圜而高，以象天也。方丘者，北郊泽中之丘，丘方而下，以象地也。”于是决定天地分祭，在大祀殿南建圜丘祭天，在北城安定门外另建方泽坛祭地。嘉靖十三年（1534年）圜丘改名天坛，方泽改名地坛。大祀殿废弃后，改为祈谷坛。嘉靖十七年（1538年）祈谷坛被废，于十九年在坛上另建大享殿，二十四年建成。\n1949年中华人民共和国成立后，政府对天坛的文物古迹投入大量的资金，进行保护和维修。进行过多次修缮和大规模绿化，使古老的天坛更加壮丽，公园占地200公顷，四面各有一门。园内有二百年以上的古柏二千五百多棵。还有百花园种植了大量的花卉。\n1961年，国务院公布天坛为“全国重点文物保护单位”。1998年被联合国教科文组织确认为“世界文化遗产”。2007年5月8日，天坛公园经国家旅游局正式批准为国家5A级旅游景区。  \n\n"
        });
        building.Add(Enum_Building.XianNongTan, new Building()
        {
            title = "先农坛"
,
            main = "\n先农，远古称帝社、王社，至汉时始称先农。春时东耕于藉田，引诗 先农坛 先农，则神农也”引；“坛于田，以祀先农”引。魏时，先农为国六神之一(“风伯、雨师、灵星、先农、社、稷为国六神”引)。藉天祭先农，唐前为帝社，祭坛曰藉田坛，垂拱年（公元685～688年）后改为先农坛。至此祭祀先农正式定为封建社会的一种礼制，每年开春，皇帝亲领文武百官行藉田礼于先农坛。"
,
            detail = "\n先农坛的建筑群，包括现存的内坛墙在内，从明代始建到清乾隆期大修，迄今历经400余年，整体布局基本完整，建筑的构筑特色及艺术风格基本保留了明代特征。\n这些祭祀建筑，根据祭祀活动中的不同要求分为宫殿建筑(皇帝祭祀前后的更衣场所、文武百官祭祀后的庆功之地、祭祀太岁的殿宇等)及象征生产等项功能性建筑(神仓、神厨、神库等)。\n由于使用的不同要求，建筑的结构及技艺又有所差别：宫殿建筑雄伟壮观，庑殿或歇山屋面，外表辉煌，采用黑色或绿色琉璃瓦，内部雕造精细，用鎏金斗硕装饰，格扇门窗用三交六碗菱花，建筑内外用金龙和玺彩绘等。其余建筑虽然也为厅堂结构，但灰瓦硬山及简练的装饰，与前者形成明显的等级对比。另外，现保留完整的内坛墙，外皮用城砖淌白糙砌，基本为乾隆期原制，内层有明代夯土墙体。墙宽2.2米，高4.1米，墙顶置木椽望板，上盖筒板瓦。内坛墙四面各设三间拱券门一座，南门与太岁殿建筑群置于同一轴线，北门在神仓院与俱服殿之间，东西门基本相对应于观耕台及先农坛之南。四座门均为砖石结构，歇山顶，黑琉璃瓦绿剪边，砖柱间额枋上置三踩单翘磨砖斗硕，四座门均具典型的明代特征，南北二门留有清晰的早期龙锦枋心旋子彩画。\n\n"
        });
        building.Add(Enum_Building.YongDingMen, new Building()
        {
            title = "永定门"
,
            main = "\n永定门，是明清北京外城城墙的正门，位于北京中轴线上，于左安门和右安门中间，是北京外城城门中最大的一座，也是从南部出入京城的通衢要道。"
,
            detail = "\n永定门，始建于明嘉靖三十二年（1553年），寓“永远安定”之意。城楼形制一如内城，重檐歇山三滴水楼阁式建筑，灰筒瓦覆顶，面阔七间，通宽24米；进深三间，通进深10.50米；楼连台通高26米，永定门瓮城城墙于1950年开始被陆续拆除，1957年以妨碍交通和已是危楼为名，永定门城楼和箭楼遭到拆毁。2004年北京永定门城楼复建，其中瓮城和箭楼尚未修建，成为北京城第一座复建的城门。\n永定门，始建于明嘉靖三十二年（1553年），寓意为“永远安定”。城楼为两层，面阔五间（24米），进深二间（10.5米），绿琉璃剪边灰筒瓦重檐歇山顶。城楼下为城台，前为1544年增建的瓮城，东西宽42米，南北深36米。\n上世纪50年代，面对城市建设与古城保护的矛盾，认为北京古城“完全是服务于封建统治者的意旨”（引自1953年11月，《改建与扩建北京市规划草案的要点》）之说占了上风。故从1950年始，永定门瓮城城墙被陆续拆除。1957年，又以妨碍交通和已是危楼为名，将城楼和箭楼拆除。\n永定门，2004年重建，北京人都知道，老北京城分为内城、外城，原有“内九外七”共16座城门。但是自从民国时期开始拆除部分城门、解放初期为了改善道路交通又拆除大部分城门以来，北京内城原有的9座城门，只余正阳门城楼、箭楼、德胜门箭楼，北京外城原有的7座城门，则无一遗存。\n永定门城楼于1957年被拆除，新永定门城楼是2004年重建的。重建后的永定门城楼门洞上方所嵌石匾，楷书“永定门”三字，苍劲雄健，是仿照明代原配石匾雕刻的。说起这块石匾，还有一个故事：在重建永定门城楼的前一年——2003年，人们在先农坛北京古代建筑博物馆门口的一株古柏树下，发现了一块保存完好的永定门石匾。据考证这块石匾正是明嘉靖三十二年（1553）始建永定门时的原配石匾。\n人们看到的，重建的永定门洞上方所嵌石匾上的“永定门”三字，就是仿照这块石匾雕刻的。永定门重建使用的城砖，是原来嘉靖年间制造的永定门老城砖。一九五四年建三台山危险品仓库，正赶上拆除永定门，城砖就拿来修了仓库的围墙。这些嘉靖年间制造的老城砖在近半个世纪后又运回来了，重新砌在永定门的城墙上。重建时，围绕永定门城楼，还修建了一座小巧精致的公园——永定门公园。公园树木，种植有序、排列整齐；城楼广场，白栏环绕、平滑如镜。公园与两旁的天坛和先农坛辉映相交；与北面的前门大街和正阳门城楼相视对望。重建后的永定门城楼已经成为名副其实的北京“城市标志性建筑”，见证着北京城市历史的变迁\n\n"
        });
        building.Add(Enum_Building.ZhengYangMen, new Building()
        {
            title = "正阳门"
,
            main = "\n正阳门，俗称前门、前门楼子、大前门， [1]  原名丽正门，是明清两朝北京内城的正南门。位于北京城南北中轴线上的天安门广场最南端，毛主席纪念堂南边。始建于明成祖永乐十七年（1419年），是老北京“京师九门”之一。它集正阳门城楼、箭楼与瓮城为一体，是一座完整的古代防御性建筑体系。 据地方志上记载：当时的城楼、箭楼规模宏丽，形制高大；瓮城气势雄浑，为老北京城垣建筑的代表之作，现仅存城楼和箭楼，是北京城内唯一保存较完整的城门。城楼上有北京民俗展览馆。"
,
            detail = "\n明永乐元年（1403年）明成祖朱棣登基后，意将都城从南京应天府（今南京市）迁到北京，于是下诏改北平为北京，并从永乐四年（1406年）开始营建北京的宫殿和城垣， [3]  并将元大都城南城垣向南拓展近一公里，当时仍沿称丽正门。这次移建历时两年，明永乐十七年（1419年）始建，于永乐十九年（1421年）完工。其后，经洪熙、宣德两代，一直称丽正门，形制未变。\n正阳门，原名丽正门，原由瓮城墙连为一体，后因修路分割成了两个部分。但一般人们也把大栅栏那个地方叫做前门，范围是正阳门和它前面的珠宝市、大栅栏等区域，而正阳门是指正阳门城楼和箭楼的统称。处在北京城的南北中轴线上。正阳门箭楼、城楼、瓮城、正阳桥和五牌楼是一组布局合理、造型庄严、气势凝重的建筑群。\n在北京城诸门中，正阳门规制最为隆崇，是中国封建社会后期城市布局、军事防御、礼仪制度和建筑艺术的形象体现，也是老北京历史文化的重要载体。正阳门作为北京仅有的一座城楼、箭楼保存完好的封建帝都之门，既是历史文化遗存，也是北京古都特色的绝佳载体，人文蕴涵深厚。正阳门作为不可再生的文物资源，以其无声的建筑语言，不仅向世人展示出封建社会都邑城垣中的一个局部，而且，在古代建筑、文化艺术、民俗礼仪、王朝历史等方面，都有其独立的存在意义与研究价值，是北京历史文化名城的重要组成部分、老北京城的标志性建筑。 \n\n"
        });
        building.Add(Enum_Building.Zhonglou, new Building()
        {
            title = "钟楼"
,
            main = "\n钟楼，位于北京东城区地安门外大街，在鼓楼北，是老北京中轴线的北端点。原址为元大都大天寿万宁寺之中心阁。"
,
            detail = "\n钟楼在鼓楼以北约100多米处，原是元代万宁寺的中心阁，始建于至元九年（1272年），后来毁于战火。明永乐十八年（1420年）与鼓楼一起重建，成为钟楼，但不久后就再次被毁。清乾隆十年（1745年）奉旨重建，两年后竣工。这次为了防止火灾，建筑全部采用了砖石结构。曾被北京防空指挥部作为办公地，1980年代后誊退。\n钟楼原有明永乐年间铸造的铁钟一口，置放于楼外平地上，后由古钟博物馆收藏。钟楼内正中位置安架一八角形木框架，其上悬钟。该钟铸造于明永乐十八年，钟通高7.02米，最大直径3.40米，重约63吨，为目前我国发现最重的铜钟。\n钟楼上说明题板介绍称此钟为《古钟之王》应是目前我国乃至世界有记载的最大最重的古钟。\n\n"
        });
    }

}
